## 1. Importing libraries

In [50]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 2. Task

### 2.3  Import the orders_products_combined dataframe from the pickle file you just saved.

In [51]:
# Turn project folder path into a string
path = r'C:\Users\Admin\Desktop\Data Analysis\Python\04-2024 Instacart Basket Analysis'

In [52]:
path

'C:\\Users\\Admin\\Desktop\\Data Analysis\\Python\\04-2024 Instacart Basket Analysis'

In [53]:
# Import orders_products_combined.pkl
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

### 2.4 Check the shape of the imported dataframe.

In [54]:
# Checking the shape of df_ords_prods
df_ords_prods.shape

(32434489, 10)

In [55]:
# checking the output of df_ords_prods
df_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [56]:
# Droping the _merge columns to prep dataframe for future merge
df_ords_prods = df_ords_prods.drop(columns = ['_merge'])

In [57]:
# Checking the output of df_ords_prods
df_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [58]:
# Checking the shape of df_ords_prods after drops
df_ords_prods.shape

(32434489, 9)

### 2.5 Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [59]:
# Import products_checked.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [60]:
# Checking for df_prods output
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [61]:
# Droping the unnamed columns which converted from the index from the .csv file
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [62]:
# Checking for df_prods output after dropping 'unnamed' column
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [64]:
# Check the shape of df_prods
df_prods.shape

(49672, 5)

In [73]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

#### Product id max value is more than count, which could mean some number might be skip or some product have duplicated value.

In [101]:
# Checking for duplicated value in 'product_id' column
df_dups = df_prods[df_prods.duplicated(['product_id'], keep=False)]

In [100]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
6784,6800,Revive Zero Vitamin Water,64,7,6.4
6785,6800,Sprouted Quinoa Flakes Baby Cereal,92,18,14.0
26504,26520,Clinical Advanced Solid Ultimate Fresh Anti-Pe...,80,11,10.6
26505,26520,Cheese Shredded Sharp Cheddar Reduced Fat 2%,21,16,2.9

#### There are 2 products id that have duplicated product id. Solution is to change the product_id to a different product_id to prevent issue with merge.

In [119]:
# Changing the duplicated product_id for 6800 : Sprouted Quinoa Flakes Baby Cereal to max value in product_id + 1
df_prods.at[6785, 'product_id'] = 49689

In [120]:
# Changing the duplicated product_id for 26520 : Cheese Shredded Sharp Cheddar Reduced Fat 2% to max value in product_id + 2
df_prods.at[26505, 'product_id'] = 49690

In [121]:
# Checking for duplicated value in 'product_id' column after change
df_dups = df_prods[df_prods.duplicated(['product_id'], keep=False)]

In [122]:
df_dups

Empty DataFrame
Columns: [product_id, product_name, aisle_id, department_id, prices]
Index: []

#### No more duplicate product_id found.

In [123]:
# Checking product_id successfully change from 6800 to 49689 for Sprouted Quinoa Baby Cereal
df_prods.iloc[6785]

product_id                                    49689
product_name     Sprouted Quinoa Flakes Baby Cereal
aisle_id                                         92
department_id                                    18
prices                                         14.0
Name: 6785, dtype: object

In [124]:
# Checking product_id successfully change from 26505 to 49690 for Sprouted Quinoa Baby Cereal
df_prods.iloc[26505]

product_id                                              49690
product_name     Cheese Shredded Sharp Cheddar Reduced Fat 2%
aisle_id                                                   21
department_id                                              16
prices                                                    2.9
Name: 26505, dtype: object

In [144]:
# Merge df_ords_prods with df_prods using the column 'product_id' using left join
ords_prods_merge = df_ords_prods.merge(df_prods, on = 'product_id', how = "left", indicator = True)

In [126]:
# Check output of ords_prods_merge
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77.0,7.0,9.0,both
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91.0,16.0,12.5,both
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,23.0,19.0,4.4,both
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,23.0,19.0,4.7,both
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54.0,17.0,1.0,both

In [127]:
# Check the shape of ords_prods_merge
ords_prods_merge.shape

(32434489, 14)

### 2.6 Confirm the results of the merge using the merge flag.

In [128]:
# Checking results of merge using the merge flag
ords_prods_merge['_merge'].value_counts()

_merge
both          32404289
left_only        30200
right_only           0
Name: count, dtype: int64

In [130]:
ords_prods_merge.isnull().sum()

order_id                        0
user_id                         0
order_number                    0
order_day_of_week               0
order_hour_of_day               0
days_since_prior_order    2078068
product_id                      0
add_to_cart_order               0
reordered                       0
product_name                30200
aisle_id                    30200
department_id               30200
prices                      30200
_merge                          0
dtype: int64

In [134]:
ords_prods_merge_null = ords_prods_merge[ords_prods_merge['_merge'] == 'left_only']

In [136]:
ords_prods_merge_null.shape

(30200, 14)

In [143]:
ords_prods_merge_null

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
2963,7099,27,63,3,10,1.0,6799,1,0,NaN,NaN,NaN,NaN,left_only
3205,1837192,27,80,2,8,6.0,6799,9,1,NaN,NaN,NaN,NaN,left_only
3253,3331846,28,3,0,16,2.0,34,6,0,NaN,NaN,NaN,NaN,left_only
3395,1385910,28,21,2,17,1.0,34,1,1,NaN,NaN,NaN,NaN,left_only
4694,2873174,38,1,0,10,NaN,116,11,0,NaN,NaN,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32424724,443233,206139,2,1,17,17.0,34,2,1,NaN,NaN,NaN,NaN,left_only
32424730,1507543,206139,3,1,8,14.0,34,2,1,NaN,NaN,NaN,NaN,left_only
32426528,1282274,206155,4,6,9,3.0,2240,18,0,NaN,NaN,NaN,NaN,left_only
32431336,1586626,206194,9,1,20,17.0,1511,6,0,NaN,NaN,NaN,NaN,left_only
32431359,56974,206194,11,5,0,30.0,1511,9,1,NaN,NaN,NaN,NaN,left_only

#### Since there are some order_id which contains product_id which is not in the i decided to switch to inner join to remove these data.

In [145]:
# Merge df_ords_prods with df_prods using the column 'product_id' using left join
ords_prods_merge = df_ords_prods.merge(df_prods, on = 'product_id', how = "inner", indicator = True)

In [146]:
# Check the output of ords_prods_merge
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [147]:
# Check the shape of ords_prods_merge
ords_prods_merge.shape

(32404289, 14)

In [148]:
# Checking results of merge using the merge flag
ords_prods_merge['_merge'].value_counts()

_merge
both          32404289
left_only            0
right_only           0
Name: count, dtype: int64

#### Now the merged data only contains data which have relevant product_id and details.

### 2.7 Exporting Data

In [149]:
# Export ords_prods_merge to pkl
ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merge.pkl'))